#!/usr/bin/env python
# -*- coding: utf-8 -*-

# -----------------------------------------------------------------------------
# 评分规则
#   不同表现参数的得分
# -----------------------------------------------------------------------------

# 得分计算规则
# ------------------------------------------------------------------------
class NormalScoreRule:
    """
        足球赛球员得分通用计算规则
    """
    # 首发得分
    first_on_group = 2
    # 未失球门将、后场得分
    unlost_goal_ev_1 = 4
    # 未失球前卫得分
    unlost_goal_ev_2 = 1
    
    # 门将、后场进球得分
    goal_ev_1 = 8
    # 前卫进球得分
    goal_ev_2 = 6
    # 前锋进球得分
    goal_ev_3 = 4
    
    # 助攻得分
    assist_ev = 3
    
    # 传球得分
    trans_ev_ration = 15
    # 抢断得分
    break_ev = 1
    # 越位得分
    over_ev = -0.5
    # 黄牌得分
    yellow_card = -1
    # 红牌得分
    red_card = -3

class OlypicsScoreRule:
    """
        奥运足球赛得分计算规则
    """
    # 首发得分
    first_on_group = 3
    # 未失球门将、后场得分
    unlost_goal_ev_1 = 4
    # 未失球前卫得分
    unlost_goal_ev_2 = 2
    
    # 门将、后场进球得分
    goal_ev_1 = 7
    # 前卫进球得分
    goal_ev_2 = 5
    # 前锋进球得分
    goal_ev_3 = 3
    
    # 助攻得分
    assist_ev = 4
    
    # 传球得分
    trans_ev_ration = 15
    # 抢断得分
    break_ev = 1.5
    # 越位得分
    over_ev = -0.3
    # 黄牌得分
    yellow_card = -1
    # 红牌得分
    red_card = -3

# ------------------------------------------------------------------------
